work/log.ltccip8.2020-06-12_1807/sysbench-mariadb-oltp-ro-small/iter-0/sysbench/logs/sysbench-raw-79-3
sysbench --mysql-user=root --mysql-password=mmtests-default --mysql-db=sbtest --mysql-socket=/tmp/mysql.sock --mysql-table-engine=innodb --test=oltp --oltp-read-only --oltp-test-mode=complex --oltp-table-size=891000 --num-threads=79 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 79

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140266
        write:                           0
        other:                           20038
        total:                           160304
    transactions:                        10019  (18208.43 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140266 (254917.97 per sec.)
    other operations:                    20038  (36416.85 per sec.)

Test execution summary:
    total time:                          0.5502s
    total number of events:              10019
    total time taken by event execution: 42.7874
    per-request statistics:
         min:                                  1.77ms
         avg:                                  4.27ms
         max:                                 10.63ms
         approx.  95 percentile:               5.31ms

Threads fairness:
    events (avg/stddev):           126.8228/22.48
    execution time (avg/stddev):   0.5416/0.00